Model: "model_14"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_15 (InputLayer)       [(None, 96, 96, 3)]       0         
                                                                 
 conv2d_56 (Conv2D)          (None, 96, 96, 32)        896       
                                                                 
 max_pooling2d_56 (MaxPoolin  (None, 48, 48, 32)       0         
 g2D)                                                            
                                                                 
 conv2d_57 (Conv2D)          (None, 48, 48, 32)        9248      
                                                                 
 max_pooling2d_57 (MaxPoolin  (None, 24, 24, 32)       0         
 g2D)                                                            
                                                                 
 conv2d_58 (Conv2D)          (None, 24, 24, 64)        18496     
                                                                 
 max_pooling2d_58 (MaxPoolin  (None, 12, 12, 64)       0         
 g2D)                                                            
                                                                 
 conv2d_59 (Conv2D)          (None, 12, 12, 64)        36928     
                                                                 
 max_pooling2d_59 (MaxPoolin  (None, 6, 6, 64)         0         
 g2D)                                                            
                                                                 
 flatten_14 (Flatten)        (None, 2304)              0         
                                                                 
 dropout_14 (Dropout)        (None, 2304)              0         
                                                                 
 dense_28 (Dense)            (None, 512)               1180160   
                                                                 
 dense_29 (Dense)            (None, 1)                 513       
                                                                 
=================================================================
Total params: 1,246,241
Trainable params: 1,246,241
Non-trainable params: 0
_________________________________________________________________
