Model: "model_24"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_25 (InputLayer)       [(None, 96, 96, 3)]       0         
                                                                 
 conv2d_96 (Conv2D)          (None, 96, 96, 32)        896       
                                                                 
 max_pooling2d_96 (MaxPoolin  (None, 48, 48, 32)       0         
 g2D)                                                            
                                                                 
 conv2d_97 (Conv2D)          (None, 48, 48, 32)        9248      
                                                                 
 max_pooling2d_97 (MaxPoolin  (None, 24, 24, 32)       0         
 g2D)                                                            
                                                                 
 conv2d_98 (Conv2D)          (None, 24, 24, 64)        18496     
                                                                 
 max_pooling2d_98 (MaxPoolin  (None, 12, 12, 64)       0         
 g2D)                                                            
                                                                 
 conv2d_99 (Conv2D)          (None, 12, 12, 64)        36928     
                                                                 
 max_pooling2d_99 (MaxPoolin  (None, 6, 6, 64)         0         
 g2D)                                                            
                                                                 
 flatten_24 (Flatten)        (None, 2304)              0         
                                                                 
 dropout_24 (Dropout)        (None, 2304)              0         
                                                                 
 dense_48 (Dense)            (None, 512)               1180160   
                                                                 
 dense_49 (Dense)            (None, 1)                 513       
                                                                 
=================================================================
Total params: 1,246,241
Trainable params: 1,246,241
Non-trainable params: 0
_________________________________________________________________
