Model: "model_42"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_43 (InputLayer)       [(None, 96, 96, 3)]       0         
                                                                 
 conv2d_168 (Conv2D)         (None, 96, 96, 32)        896       
                                                                 
 max_pooling2d_168 (MaxPooli  (None, 48, 48, 32)       0         
 ng2D)                                                           
                                                                 
 conv2d_169 (Conv2D)         (None, 48, 48, 32)        9248      
                                                                 
 max_pooling2d_169 (MaxPooli  (None, 24, 24, 32)       0         
 ng2D)                                                           
                                                                 
 conv2d_170 (Conv2D)         (None, 24, 24, 64)        18496     
                                                                 
 max_pooling2d_170 (MaxPooli  (None, 12, 12, 64)       0         
 ng2D)                                                           
                                                                 
 conv2d_171 (Conv2D)         (None, 12, 12, 64)        36928     
                                                                 
 max_pooling2d_171 (MaxPooli  (None, 6, 6, 64)         0         
 ng2D)                                                           
                                                                 
 flatten_42 (Flatten)        (None, 2304)              0         
                                                                 
 dropout_42 (Dropout)        (None, 2304)              0         
                                                                 
 dense_84 (Dense)            (None, 512)               1180160   
                                                                 
 dense_85 (Dense)            (None, 1)                 513       
                                                                 
=================================================================
Total params: 1,246,241
Trainable params: 1,246,241
Non-trainable params: 0
_________________________________________________________________
