Model: "model_58"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_59 (InputLayer)       [(None, 96, 96, 3)]       0         
                                                                 
 conv2d_232 (Conv2D)         (None, 96, 96, 32)        896       
                                                                 
 max_pooling2d_232 (MaxPooli  (None, 48, 48, 32)       0         
 ng2D)                                                           
                                                                 
 conv2d_233 (Conv2D)         (None, 48, 48, 32)        9248      
                                                                 
 max_pooling2d_233 (MaxPooli  (None, 24, 24, 32)       0         
 ng2D)                                                           
                                                                 
 conv2d_234 (Conv2D)         (None, 24, 24, 64)        18496     
                                                                 
 max_pooling2d_234 (MaxPooli  (None, 12, 12, 64)       0         
 ng2D)                                                           
                                                                 
 conv2d_235 (Conv2D)         (None, 12, 12, 64)        36928     
                                                                 
 max_pooling2d_235 (MaxPooli  (None, 6, 6, 64)         0         
 ng2D)                                                           
                                                                 
 flatten_58 (Flatten)        (None, 2304)              0         
                                                                 
 dropout_58 (Dropout)        (None, 2304)              0         
                                                                 
 dense_116 (Dense)           (None, 512)               1180160   
                                                                 
 dense_117 (Dense)           (None, 1)                 513       
                                                                 
=================================================================
Total params: 1,246,241
Trainable params: 1,246,241
Non-trainable params: 0
_________________________________________________________________
